Revit 2024 API
DimensionSegmentArray.Append Method
Add the item to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	DimensionSegment item
)
Visual Basic
Public Overridable Sub Append ( _
	item As DimensionSegment _
)
Visual C++
public:
virtual void Append(
	DimensionSegment^ item
)
Parameters
item
Type: Autodesk.Revit.DB.DimensionSegment
The item to be added.
See Also
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace